
#已有方法 rand7 可生成 1 到 7 范围内的均匀随机整数，试写一个方法 rand10 生成 1 到 10 范围内的均匀随机整数。
class Solution:
    def rand10(self):
        """
        :rtype: int
        """
        while True :
            # (rand7()-1)*7+rand7()是为了实现随机生成1-49的随机数，且每个数的概率相等
            num=(rand7()-1)*7+rand7()
            #如果在40以内，那就直接返回
            if(num<=40):
                return 1+num%10
            # 说明刚才生成的在41 - 49之间，利用随机数再操作一遍
            # (num - 40 - 1) * 7 + rand7()是为了实现随机生成1-63的随机数，且每个数的概率相等
            num = (num - 40 - 1) * 7 + rand7()
            if(num<=60):
                return 1+num%10
            #说明刚才生成的在61 - 63之间，利用随机数再操作一遍
            # (num - 60 - 1) * 7 + rand7()是为了实现随机生成1-21的随机数，且每个数的概率相等
            #随机生成的区间排除之外的数越来越少（9->3->1）,落在要求的区间的概率就越大
            num = (num - 60 - 1) * 7 + rand7()
            if(num<=20):
                return 1+num%10